/*--------------------------------------------*

	制作者：荒井敬生
	制作日：2017/05/12
	課題No.13

*---------------------------------------------*/

#include <stdio.h>
#define		MAX		256
#define		HEX		16
#define		COMP	0xFFFF

/*プロトタイプ宣言*/
void itohex(int, char*);
void itohexEX(int, char*);

void main(void)
{
	int		work;
	char	buf[MAX];
	
	//printf("buf[0]:%x\n",&buf[0]);
	
	//buf[0] = 1;
	//printf("buf[0]:%x\n",&buf[0]);
	
	printf("DEC input => ");
	scanf("%d",&work);
	itohexEX(work,buf);
	printf("HEX output=> %s\n",buf);
	
}


/*--------------------------------------------*
	制作者	：荒井敬生
	制作日	：2017/05/15
	関数名	：itohex
	機能概要：10進数の数字を16進数の文字列に変換　負の数未対応
*---------------------------------------------*/
void itohex(int dec,char *buf)
{
	int		i, j, h;
	int		d;      					//入力された数の計算ようの容れものだよ
	char	c[MAX];						//仮に入れとく配列だよ
										//十進数の0~15に対応したchar型の配列作るよ
	char	copy[] = {'0','1','2','3','4','5','6','7','8','9','A','B','C','D','E','F'};
	
	j = 0;
	d = dec;
	
	//printf("buf[0]:%x\n",&buf[0]);
	
	if(d < HEX)							//入力された数が16未満ならそれを配列に入れるよ、ぶっちゃけここで終わりだよ
	{
		c[0] = copy[d];
	}
		
	//printf("d:%d\n",d);
	for(i = 0;d >= HEX;i++)				//計算対象の数が16未満になるまでループだよ
	{
		
		h = d % HEX;					//計算対象を16で割った数をだすよ
		
		//printf("prv copy[d %% HEX]:%c\n",copy[h]);
		c[i] = copy[h];					//前に出した数に対応した16進数の数を
		//printf("prv c[i]:%c\n",c[i]);
		
		d = d / HEX;					//計算対象を16で割って代入だ
		if(d < HEX)						//割った結果が16未満だったら、答えを次の配列にいれてループ終わり
		{
			i++;
			c[i] = copy[d];
			break;
			//printf("%d i:%d\n",__LINE__,i);
			//printf("%d d:%d\n",__LINE__,d);
		}
		//printf("%d i:%d\n",__LINE__,i);
	}
	
	//printf("%d i:%d\n",__LINE__,i);
	
	/*
	printf("c[0]:%c\n",c[0]);
	printf("c[1]:%c\n",c[1]);
	printf("c[2]:%c\n",c[2]);
	printf("c[3]:%x\n",c[3]);
	*/
	
	for(;i >= 0;i--)					//仮に入れてる配列の中身を逆さにして出力用のとこにいれてくよ
	{
		//printf("%d i:%d\n",__LINE__,i);
		buf[j] = c[i];
		j++;
	}
	//printf("buf[0]:%c\n",buf[0]);
	
	buf[j] = '\0';						//最後にエンエヌを忘れるな
	
}


/*------------------------------------------------------------------------*
	制作者	：荒井敬生
	制作日	：2017/05/15
	関数名	：itohexEX
	機能概要：10進数の数字を16進数の文字列に変換
			  負の数もいけるまさにEX.......いいたかっただけです
*-------------------------------------------------------------------------*/
void itohexEX(int dec,char *buf)
{
	int		i, j, h;
	int		d;      					//入力された数の計算ようの容れものだよ
	char	c[MAX];						//仮に入れとく配列だよ
										//十進数の0~15に対応したchar型の配列作るよ
	char	copy[] = {'0','1','2','3','4','5','6','7','8','9','A','B','C','D','E','F'};
	
	j = 0;
	d = dec;
	
	
	if(0 <= d)								//入力数字が自然数なら
	{
		if(d < HEX)							//入力された数が16未満ならそれを配列に入れるよ、ぶっちゃけそこで終わりだよ
		{
			c[0] = copy[d];
		}
	}
	else									//負の数だったら
	{
		d = COMP + (d + 1);					//入力数字を2の補数に変換
	}
	
	for(i = 0;d >= HEX;i++)				//計算対象の数が16未満になるまでループだよ
	{	
		h = d % HEX;					//計算対象を16で割ったあまりをだすよ
		
		c[i] = copy[h];					//前に出した数に対応した16進数の数を入れ物に入れてくよ
		
		d = d / HEX;					//計算対象を16で割って代入だ
		if(d < HEX)						//割った結果が16未満だったら、答えを次の配列にいれてループ終わり
		{
			i++;
			c[i] = copy[d];
			break;
		}
	}
	
	for(;i >= 0;i--)					//仮に入れてる配列の中身を逆さにして出力用のとこにいれてくよ
	{
		buf[j] = c[i];
		j++;
	}
	
	buf[j] = '\0';						//最後にエンエヌを忘れるな
	
}